USE registryDB;
GO


BEGIN TRANSACTION
INSERT Genders VALUES
('Default', 'Default'),
('G1', 'Чоловік'),
('G2', 'Жінка'),
('G3', 'Не визначений')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Dispensary_Groups VALUES
('Default', 'Default'),
('DG0', 'Ні'),
('DG1', 'Так')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Contingents VALUES
('Default', 'Default'),
('C0', 'Без пільгової категорії'),
('C1', 'Інваліди війни'),
('C2', 'Учасники війни'),
('C3', 'Учасники бойових дій'),
('C4', 'Інваліди'),
('C5', 'Учасники ліквідації наслідків аварії на Чорнобильській АЕС'),
('C6', 'Евакуйовані'),
('C7', 'Особи, які проживають на території зони радіоекологічного контролю'),
('C8', 'Діти, які народились від батьків, які віднесені до 1, 2, 3 категорій осіб, що постраждали внаслідок Чорнобильської катастрофи, із зони відчудження, а також
	відселені із зон безумовного (обов''язкового) і гарантованого добровільного відселення'),
('C9', 'Інші пільгові категорії')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Specializations VALUES
('Default', 'Default'),
('Sp01', 'Терапевт'),
('Sp02', 'Кардіолог'),
('Sp03', 'Невролог'),
('Sp04', 'Ендокринолог'),
('Sp05', 'Хірург'),
('Sp06', 'Акушер-гінеколог'),
('Sp07', 'Педіатр'),
('Sp08', 'Логопед'),
('Sp09', 'Психолог'),
('Sp10', 'Онколог'),
('Sp11', 'Офтальмолог'),
('Sp12', 'Гастроентеролог'),
('Sp13', 'Психіатр'),
('Sp14', 'Оториноларинголог (ЛОР)'),
('Sp15', 'Травматолог'),
('Sp16', 'Фізіотерапевт'),
('Sp17', 'Ерготерапевт'),
('Sp18', 'Лаборант'),
('Sp19', 'Рентгенолог'),
('Sp20', 'Лікар ультразвукової діагностики')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Qualifications VALUES
('Default', 'Default'),
('Q1', 'Друга'),
('Q2', 'Перша'),
('Q3', 'Вища')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Statuses VALUES
('Default', 'Default'),
('St1', 'Активна робота'),
('St2', 'Відпустка'),
('St3', 'Лікарняний'),
('St4', 'Відпрацьовує у неповному режимі'),
('St5', 'Навчання/стажування')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Offices VALUES
('Default', 'Default'),
('Off101', 'Кабінет терапевта'),
('Off102', 'Кабінет кардіолога'),
('Off103', 'Кабінет невролога'),
('Off104', 'Кабінет ендокринолога'),
('Off105', 'Кабінет хірурга'),
('Off106', 'Кабінет акушера-гінеколога'),
('Off107', 'Кабінет педіатра'),
('Off108', 'Кабінет логопеда'),
('Off109', 'Кабінет психолога'),
('Off110', 'Кабінет онколога'),
('Off201', 'Кабінет офтальмолога'),
('Off202', 'Кабінет гастроентеролога'),
('Off203', 'Кабінет психіатра'),
('Off204', 'Кабінет оториноларинголога (ЛОРа)'),
('Off205', 'Кабінет травматолога'),
('Off206', 'Фізіотерапевтичний кабінет'),
('Off207', 'Ерготерапевтичний кабінет'),
('Off301', 'Лабораторія дослідження крові'),
('Off302', 'Кабінет рентгенографії'),
('Off303', 'Кабінет ультразвукової діагностики')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Doctors_Schedules VALUES
('Default', '00:00', '', '', '23:59'),
('DS1', '08:00', '13:00', '14:00', '17:00'),
('DS2', '08:00', '13:00', '14:00', '17:00'),
('DS3', '08:00', '13:30', '14:00', '16:30'),
('DS4', '08:00', '13:30', '14:00', '16:30'),
('DS5', '09:00', '13:00', '14:00', '18:00'),
('DS6', '09:00', '13:00', '14:00', '18:00'),
('DS7', '09:00', '13:30', '14:00', '17:30'),
('DS8', '09:00', '13:30', '14:00', '17:30'),
('DS9', '11:00', '', '', '17:00')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT Doctors VALUES
('Default', 'Default', 'Default', 'Default', 'Default', 'Default', 'Default'),
('Божок Лідія Богданівна',			'+380 93 220 9348', 'Sp01', 'Q1', 'St1', 'Off101', 'DS1'),
('Сімашкевич Антоніна Йосипівна',	'+380 66 082 3759', 'Sp02', 'Q3', 'St1', 'Off102', 'DS3'),
('Пасічник Юлія Олександрівна',		'+380 66 238 4599', 'Sp03', 'Q1', 'St3', 'Off103', 'DS2'),
('Карпека Оксана Петрівна',			'+380 65 365 9383', 'Sp04', 'Q1', 'St1', 'Off104', 'DS3'),
('Ситенко Євгенія Анатоліївна',		'+380 99 389 4752', 'Sp05', 'Q1', 'St1', 'Off105', 'DS1'),
('Ступка Анастасія Давидівна',		'+380 68 823 9572', 'Sp06', 'Q3', 'St1', 'Off106', 'DS4'),
('Вітовський Єгор Русланович',		'+380 95 235 8722', 'Sp07', 'Q3', 'St1', 'Off107', 'DS7'),
('Великий Іван Чеславович',			'+380 95 097 5263', 'Sp08', 'Q3', 'St2', 'Off108', 'DS3'),
('Потульницький Єгор Йосипович',	'+380 99 123 5295', 'Sp09', 'Q1', 'St2', 'Off109', 'DS3'),
('Скрипаль Ігор Пилипович',			'+380 99 238 5111', 'Sp10', 'Q1', 'St2', 'Off110', 'DS5'),
('Бенюк Ілля Константинович',		'+380 99 487 5843', 'Sp11', 'Q1', 'St1', 'Off201', 'DS4'),
('Лутоман Григорій Донатович',		'+380 68 283 6823', 'Sp12', 'Q2', 'St1', 'Off202', 'DS6'),
('Бойко Роман Романович',			'+380 96 238 4798', 'Sp13', 'Q3', 'St1', 'Off203', 'DS5'),
('Гришко Діана Іванівна',			'+380 96 485 3734', 'Sp14', 'Q3', 'St3', 'Off204', 'DS7'),
('Жадан Єремій Янович',				'+380 99 374 2234', 'Sp15', 'Q2', 'St1', 'Off205', 'DS7'),
('Лесик Івання Радимівна',			'+380 66 340 8557', 'Sp16', 'Q2', 'St1', 'Off206', 'DS6'),
('Козаченко Аліна Остапівна',		'+380 68 783 6234', 'Sp17', 'Q3', 'St1', 'Off207', 'DS6'),
('Жолдак Олег Вікторович',			'+380 97 273 6431', 'Sp18', 'Q3', 'St1', 'Off301', 'DS1'),
('Ніклевич Гордій Ростиславович',	'+380 96 975 4229', 'Sp18', 'Q3', 'St1', 'Off301', 'DS1'),
('Жолдак Олег Вікторович',			'+380 95 861 9112', 'Sp18', 'Q3', 'St1', 'Off301', 'DS1'),
('Ковпак Олексій Олегович',			'+380 99 384 5792', 'Sp19', 'Q3', 'St1', 'Off302', 'DS1'),
('Фрицький Богдан Ясимович',		'+380 64 987 9724', 'Sp20', 'Q3', 'St1', 'Off303', 'DS1')
GO
COMMIT
GO

BEGIN TRANSACTION
INSERT Medical_Services VALUES
('Default', 'Default', '1', '0', 'Default'),
('MS01', 'Огляд та консультація терапевта',			'1', '500', ''),
('MS02', 'Огляд та консультація кардіолога',		'2', '500', ''),
('MS03', 'Огляд та консультація невролог',			'3', '500', ''),
('MS04', 'Огляд та консультація ендокринолога',		'4', '500', ''),
('MS05', 'Огляд та консультація хірурга',			'5', '500', ''),
('MS06', 'Огляд та консультація акушера-гінеколога','6', '500', ''),
('MS07', 'Огляд та консультація педіатра',			'7', '500', ''),
('MS08', 'Огляд та консультація логопеда',			'8', '500', ''),
('MS09', 'Огляд та консультація психолога',			'9', '500', ''),
('MS10', 'Огляд та консультація онколога',			'10', '500', ''),
('MS11', 'Огляд та консультація офтальмолога',		'11', '500', ''),
('MS12', 'Огляд та консультація гастроентеролога',	'12', '500', ''),
('MS13', 'Огляд та консультація психіатра',			'13', '500', ''),
('MS14', 'Огляд та консультація оториноларинголога','14', '500', ''),
('MS15', 'Огляд та консультація травматолога',		'15', '500', ''),
('MS16', 'Електрокардіографія',			'2',		'3500', 'Проведення повного обстеження серця'),
('MS17', 'Клінічний аналіз крові',		'18',		'2500', 'Проведення повного аналізу крові'),
('MS18', 'Біохімічний аналіз крові',	'20',		'2500', 'Проведення повного аналізу крові'),
('MS19', 'Рентгенографія',				'21',		'1000', 'Проведення рентгенографії з виведенням результату на комп''ютер'),
('MS20', 'Ультразвукове дослідження',	'22',		'1000', 'Проведення УЗД з виведенням результату на комп''ютер'),
('MS21', 'Комп''ютерна томографія',		'21',		'3500', 'Проведення томографії з виведенням результату сканування на комп''ютер у 3D')
GO
COMMIT
GO


 BEGIN TRANSACTION
INSERT INTO Users (Name, Password, Offices, Specializations, Qualifications, Statuses, Medical_Services, Doctors, Doctors_Schedules, Appointments, Patients, Genders,
					Medical_Cards, Dispensary_Groups, Contingents, Users) VALUES
	('Receptionist', 'Receptionist', 'Ні', 'Ні', 'Ні', 'Ні', 'Ні', 'Ні', 'Ні', 'Так', 'Так', 'Ні', 'Так', 'Ні', 'Ні', 'Ні'),
	('Admin', 'Admin', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так', 'Так')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT INTO Medical_Cards (ID_Card, ID_EDRPOU, ID_Dispensary_Group, ID_Contingent, Preferential_License_Number, Medical_Card_Registration_Date) VALUES
(0, 00000000, 'Default', 'Default', 000000, '00:00:00 10.10.1910')
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT INTO Patients (Name, ID_Gender, Date_of_Birth, Phone, Location, ID_Card) VALUES
('Default', 'Default', '01.01.1901', '+380000000000', 'Earth', 0)
GO
COMMIT
GO


BEGIN TRANSACTION
INSERT INTO Appointments (Appointment_Registration_Time, ID_Patient, ID_Service) VALUES
(GETDATE(), 1, 'MS10')
GO
COMMIT
GO